---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.ProjectionPlanesParallel
source: html/1d380da3-663f-853b-6e67-f3decfe9fa62.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.ProjectionPlanesParallel Property

Can't project Analytical Model. Two or more projection planes are parallel.

## Syntax (C#)
```csharp
public static FailureDefinitionId ProjectionPlanesParallel { get; }
```